[{"id":"22823418","title":"Israeli army spokesman: We will respond forcefully to every attack; we are in a multi-front war.","category":"cat10","time":"10 minutes agosource","link":""},{"id":"22823416","title":"Israeli army: We strike throughout Iran to protect Israel's security.","category":"cat10","time":"13 minutes agosource","link":""},{"id":"22823415","title":"The Israeli military announces the killing of Iran's IRGC commander, the defense minister, Ali Shamkhani, adviser to the Supreme Leader, and other senior commanders","category":"cat10","time":"13 minutes agosource","link":""},{"id":"22823414","title":"The US military carried out nearly 900 US strikes in the first 12 hours of this operation, US defense official tells. The strikes came from land, air and sea and included drones. All the while defending against 100s of incoming Iranian ballistic missiles. Iran has fired about 300 missiles today. They have 2000 long range missiles and 2000 shorter range missiles. In Bahrain at the 5th Fleet HQ the Iranians hit an empty warehouse and a Ray Dome - radar installation. There are multiple redundancies and nothing that has happened has affected the mission. What is the goal/end state: Iran doesn't have the capability to attack its neighbors: no drones, no missiles, no Navy. The US and its partners know where Iran's highly enriched uranium is, but it is hard to get to. Expect the operation to last a couple of weeks. But POTUS could decide to off ramp early if he chooses. There are still a number of air defenses left. Will take a few days to suppress","category":"cat10","time":"17 minutes agosource","link":""},{"id":"22823417","title":"US official confirms to Fox that US believes Khamenei and 5-10 top Iranian leaders killed in initial Israeli strike on compound; agree with Israel's intelligence assessment. Iranian leaders who were all meeting at a compound in Tehran Saturday morning. The top IRGC commander also killed. Multiple sources tell that the timeline for the strike had to be moved up based on intelligence and this target of opportunity. There was a deliberate decision to accelerate the timeline. That is why the US and Israel took the unusual decision to strike during the daytime to achieve the element of surprise and to target this meeting. Normally the US military would not launch an operation like this during the day. The meeting accelerated the timeline. This was a massive, wildly bold daytime attack. It caught the senior leadership off guard, a Saturday morning during Ramadan and on Shabbat in the daytime. We hit the senior leaders right out of the gate","category":"cat10","time":"21 minutes agosource","link":""},{"id":"22823412","title":"An Iranian official told Al Jazeera: Trump thought an attack on Iran might last four hours, but Washington could become embroiled in a major and devastating war.","category":"cat1","time":"22 minutes agosource","link":""},{"id":"22823410","title":"Kuwaiti Ministry of Defense: Air defenses intercepted a drone targeting Mohammed Al-Ahmad Naval Base","category":"cat1","time":"23 minutes agosource","link":""},{"id":"22823406","title":"Kuwait Ports Authority: Temporary precautionary halt to operations at Shuaiba Port after debris fell in its vicinity","category":"cat11","time":"36 minutes agosource","link":""},{"id":"22823404","title":"An Iraqi security source told Al Jazeera that a radar station in the Basra Operations Command was targeted by Iranian drones.","category":"cat1","time":"41 minutes agosource","link":""},{"id":"22823403","title":"The Iranian radar site in Bandar Abbas was damaged","category":"cat10","time":"an hour agosource","link":""},{"id":"22823402","title":"Israeli Defense Minister: Israel will not allow those who threaten it to survive.","category":"cat10","time":"an hour agosource","link":""},{"id":"22823398","title":"Israeli media, citing an official source: Iranian Supreme Leader Ali Khamenei has been killed.","category":"cat10","time":"an hour agosource","link":""},{"id":"22823395","title":"Iran's Supreme Leader Ayatollah Ali Khamenei was killed in an Israeli airstrike this morning on Iran, with his body being found recently among the rubble, Israeli officials tell The Times of Israel","category":"cat10","time":"an hour agosource","link":""},{"id":"22823396","title":"Larijani: We regret the Israeli criminals and the shameless Americans. The brave soldiers and the great nation of Iran will teach an unforgettable lesson to the oppressive international hell-bent.","category":"cat1","time":"an hour agosource","link":""},{"id":"22823397","title":"Iranian bombing targets Jebel Ali port, which houses the headquarters of global trading companies","category":"cat1","time":"an hour agosource","link":""},{"id":"22823392","title":"Explosions were reported near Al Udeid Air Base in Qatar","category":"cat1","time":"an hour agosource","link":""},{"id":"22823389","title":"The White House: Trump spoke to the leaders of the UAE, Saudi Arabia, Qatar, and the NATO Secretary General.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823393","title":"US Department of State: Following the launch of U.S. combat operations in Iran, Americans worldwide and especially in the Middle East should follow the guidance in the latest security alerts issued by the nearest U.S. embassy or consulate. They may experience travel disruptions due to periodic airspace closures. The Department of State advises Americans worldwide to exercise increased caution.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823388","title":"Sirens sounded in Kuwait","category":"cat11","time":"2 hours agosource","link":""},{"id":"22823387","title":"Crossings with the Gaza Strip, including Rafah Crossing with Egypt, will remain closed amid the joint Israeli-American operation against Iran, Israel's Coordinator of Government Activities in the Territories says.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823386","title":"Prime Minister Benjamin Netanyahu in a press statement: The plan to destroy Israel no longer exists, and there is a high likelihood that the tyrant Khamenei does not either.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823385","title":"The US Central Command publishes footage showing its strikes against Iran today, including targeting an Iranian drone on the ground","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823374","title":"The U.S. military releases video of what it says were strikes against Iranian military targets","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823367","title":"Sirens warning of a suspected drone infiltration sound in several northern Israeli communities next to the Lebanese border","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823356","title":"The remains of an Iranian missile that was intercepted fell in the vicinity of the town of Tuwaynan in the eastern Homs countryside without causing any damage.","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823338","title":"Satellite imagery from the Iranian port city of Konarak, located on the Gulf of Oman near the border with Pakistan, shows a large fire onboard and smoke pouring from a pierside vessel, possibly a warship with the Iranian Navy.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823337","title":"Trump told Israel's Channel 12: Iran came close to reaching an agreement, then backed out, and has no real desire to reach an agreement.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823336","title":"CENTCOM: Operation Epic Fury involves the largest regional rally of American military firepower in a generation","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823335","title":"Israeli Home Front Command: Warnings of infiltration by attack marches north of Eilat","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823333","title":"Washington warns its citizens in Iraq and suspends consular operations. The US Embassy in Baghdad issued a warning to US citizens on Saturday evening and suspended consular operations following aerial threats","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823334","title":"US Central Command: Targets in Iran included Revolutionary Guard command and control sites and air defenses","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823330","title":"US Central Command announced that damage to US facilities was minimal and did not affect operations.","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823329","title":"Activating Iranian air defenses in Sanandaj and Tabriz","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823328","title":"Heavy shelling on eastern Tehran","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823327","title":"Iranian media reported that a loud explosion was heard in Nahavand.","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823326","title":"Khamenei son in law and daughter in law were killed in today's strikes - Maysam Mozafar a member of Tehran city council said","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823325","title":"Jordanian Foreign Minister: Iran attacked Jordan, which had prevented the use of its territory and airspace in any attack against it.","category":"cat11","time":"3 hours agosource","link":""},{"id":"22823324","title":"Israeli Channel 14: Rocket fragments fell on a residential building in the Sharon region of central Israel, with no injuries reported.","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823323","title":"A source familiar with the matter told Reuters that Qatar was targeted by as many as 44 missiles and 8 drones during today's Iranian attacks.","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823321","title":"CBS, citing US officials: We used unidirectional attack drones in the attack on Iran","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823320","title":"Large number of aircrafts are currently going into Iran from the border areas with Iraqi Kurdistan - local sources","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823319","title":"Iran Red Crescent spokesperson says 24 provinces were targeted by Israeli and US strikes with at least 201 killed and 747 wounded","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823322","title":"Al-Arabiya TV correspondent: Air defenses activated on Iran's Kish Island","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823318","title":"Photo from the U.S. Fifth Fleet / CENTCOM headquarters in Bahrain shows damage after three Shahed drones reportedly struck the area","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823316","title":"US President Donald Trump monitored developments overnight surrounding US and Israeli airstrikes on Iran at Mar-a-Lago with members of his national security team, White House press secretary Karoline Leavitt said on X on Friday","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823315","title":"Iranian missile being intercepted in the skies over the Tel Aviv","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823314","title":"The U.S. Department of Transportation is urging commercial vessels to stay away from the Strait of Hormuz, the Persian Gulf, the Gulf of Oman, and the Arabian Sea.","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823313","title":"Financial Times, quoting the UK Maritime Trade Operations: The Strait of Hormuz remains open, but we advise crossing it with caution.","category":"cat2","time":"3 hours agosource","link":""},{"id":"22823311","title":"Israeli army: Warning to those present at the C Industrial Complex in Isfahan, as shown on the map: The Defense Forces will attack military infrastructure in the area within the next few minutes. Dear Iranian citizens, you must stay away from the complex.","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823310","title":"Two sources told Reuters: Egypt halts gas imports from Israel","category":"cat11","time":"3 hours agosource","link":""},{"id":"22823309","title":"Iran launches new barrage of missiles toward Israel","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823308","title":"Erdogan: I condemn the attacks on Iran's sovereignty","category":"cat7","time":"3 hours agosource","link":""},{"id":"22823306","title":"US-Israeli aircraft launch extensive airstrikes on Iran","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823307","title":"An Israeli-U.S. airstrike targeted hit Zanjan, northwestern Iran. Secondary explosions indicate the likelihood of a missile site","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823304","title":"Israeli military: Largest air strike in air force history completed","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823305","title":"New interceptions reported over Abu Dhabi amid incoming Iranian missiles/drones","category":"cat6","time":"3 hours agosource","link":""},{"id":"22823301","title":"Iran's Revolutionary Guard: The Strait of Hormuz is dangerous and de facto closed.","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823302","title":"Iraqi Army: Two airstrikes targeted the Jurf al-Sakhr area south of Baghdad for the second time today.","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823299","title":"Kuwaiti Army: Three members of the armed forces sustained minor injuries as a result of missile and drone attacks on Ali Al Salem Air Base","category":"cat11","time":"4 hours agosource","link":""},{"id":"22823303","title":"Faytuks Network video showing an Iranian drone hitting a building in Bahrain","category":"cat1","time":"4 hours agosource","link":""},{"id":"22823300","title":"Dubai Airports suspends all flights at Dubai International Airport (DXB) and Dubai World Central until further notice.","category":"cat6","time":"4 hours agosource","link":""},{"id":"22823298","title":"Iran's message to the United Nations: All American and Israeli bases, facilities, and assets in the region are legitimate targets.","category":"cat1","time":"4 hours agosource","link":""},{"id":"22823297","title":"Iranian media: Explosions heard in Karaj, west of the capital Tehran","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823296","title":"UKMTO has received multiple reports from Company Security Officers of vessels operating in the Arabian Gulf stating that the Strait of Hormuz has been closed.","category":"cat1","time":"4 hours agosource","link":""},{"id":"22823295","title":"Large explosions reported in Tehran","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823294","title":"Iranian media reported hearing the sound of an explosion in Isfahan","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823293","title":"Rocket Alerts in central Israel","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823291","title":"Bahraini air defenses are intercepting several Iranian missiles over Manama","category":"cat11","time":"5 hours agosource","link":""},{"id":"22823289","title":"Sirens, interceptors up over Haifa","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823290","title":"The UAE Ministry of Defense: The Iranian attacks are a blatant violation of national sovereignty and international law.","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823288","title":"Iran is apparently targeting areas near the Burj Khalifa, with kamikaze drones approaching the building","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823287","title":"IRGC linked forces have carried out an attack on a power plant in Hawler (Erbil) region. Power outages are being reported across Kurdistan - primarily in Duhok and Hawler (Erbil)","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823284","title":"Dubai Media Office: Civil Defense teams brought a fire under control in a building in the Palm Jumeirah area, and four injuries resulted from the incident.","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823283","title":"Qatar's Ministry of Interior: We urge citizens, residents, and visitors not to go out except for extreme necessity until the danger has passed.","category":"cat7","time":"5 hours agosource","link":""},{"id":"22823282","title":"The number of female student dead in Minab, southern Iran, has risen to 85, with dozens injured.","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823281","title":"Reuters: Ships receive high-frequency broadcasts from Iran's Revolutionary Guard saying no ships are allowed to pass through the Strait of Hormuz","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823277","title":"AFP, citing witnesses: Explosion in Palm Jumeirah, Dubai","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823276","title":"Interceptions over Tel Aviv","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823279","title":"It appears that Iran may have struck Dubai with a Shahed kamikaze drone","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823292","title":"Israeli Prime Minister Benjamin Netanyahu had a phone conversation with US President Trump","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823278","title":"Iranian news agency: Iran launches Sejjil missile at targets","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823280","title":"Iran's Revolutionary Guards have told vessels through VHF transmission that no ship is allowed to pass the Strait of Hormuz","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823275","title":"Interception of Iranian missiles over Dubai skies","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823286","title":"Iran has officially requested an urgent extraordinary meeting of the IAEA Board of Governors.","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823274","title":"The international airport in Kuwait was damaged as a result of Iranian missile attack","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823273","title":"Iran strikes the Fairmont Hotels in Dubai, UAE","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823272","title":"Area on Fire in Dubai are Air Defense Failed and fell on the city","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823285","title":"Explosions heard in Shiraz, southern Iran, following airstrikes","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823270","title":"Many explosions and interceptions in the skies over Tel Aviv","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823269","title":"Guterres: The use of force by the US and Israel and the Iranian response undermine international peace and security.","category":"cat5","time":"6 hours agosource","link":""},{"id":"22823268","title":"Airstrikes on targets around Shiraz, several explosions heard","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823266","title":"The IRGC says a U.S. Military Sealift Command combat support vessel was severely hit by missiles fired by its naval forces.","category":"cat1","time":"6 hours agosource","link":""},{"id":"22823264","title":"Israeli military: We completed a large-scale strike against the Iranian regime's strategic defense systems.","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823263","title":"France, Germany, and Britain: We call for a resumption of negotiations and a negotiated solution.","category":"cat2","time":"6 hours agosource","link":""},{"id":"22823260","title":"Sirens are sounding again in Tel Aviv","category":"cat1","time":"7 hours agosource","link":""},{"id":"22823261","title":"China calls for an immediate halt to the escalation with Iran","category":"cat9","time":"7 hours agosource","link":""},{"id":"22823259","title":"Saudi Arabia: Our forces intercepted Iranian missile attacks on Riyadh and the Eastern Province.","category":"cat11","time":"7 hours agosource","link":""},{"id":"22823262","title":"The U.S. Embassy urges American citizens to leave Lebanon","category":"cat10","time":"7 hours agosource","link":""},{"id":"22823258","title":"Israeli Channel 12, citing an Israeli source: Our assessment is growing that Khamenei has been killed.","category":"cat10","time":"7 hours agosource","link":""},{"id":"22823257","title":"A Daraa 24 correspondent reported that an Iranian missile fell on the road between the town of Nafaa and the village of Ain Dhakar in the Yarmouk Basin area of western Daraa countryside, after being intercepted by Israeli air defenses.","category":"cat10","time":"7 hours agosource","link":""}]
